# Case Study on ANOVA

In [61]:
# import libraries
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import scipy.stats as stat
from scipy import stats


import warnings
warnings.filterwarnings('ignore')

In [62]:
#read the dataset
data=pd.read_csv('Sales_data_zone_wise.csv')

In [63]:
data.head()

       Month  Zone - A  Zone - B  Zone - C  Zone - D
0  Month - 1   1483525   1748451   1523308   2267260
1  Month - 2   1238428   1707421   2212113   1994341
2  Month - 3   1860771   2091194   1282374   1241600
3  Month - 4   1871571   1759617   2290580   2252681
4  Month - 5   1244922   1606010   1818334   1326062

In [64]:
#checking null value 
data.isnull().sum()

Month       0
Zone - A    0
Zone - B    0
Zone - C    0
Zone - D    0
dtype: int64

There are no null values in the dataset, hence it is clean.

In [65]:
# checking the columns and type
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Month     29 non-null     object
 1   Zone - A  29 non-null     int64
 2   Zone - B  29 non-null     int64
 3   Zone - C  29 non-null     int64
 4   Zone - D  29 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.3+ KB

In [66]:
# checking for number of rows and columns
data.shape

(29, 5)

# 1.The mean sales generated by each zone.

In [67]:
Zone_A = data['Zone - A']
Zone_B = data['Zone - B']
Zone_C = data['Zone - C']
Zone_D = data['Zone - D']

In [68]:
mean_sales_Zone_A = round(np.mean(Zone_A),2)
mean_sales_Zone_B = round(np.mean(Zone_B),2)
mean_sales_Zone_C = round(np.mean(Zone_C),2)
mean_sales_Zone_D = round(np.mean(Zone_D),2)

In [69]:
print('Mean sales generated by Zone A is ', mean_sales_A)
print('Mean sales generated by Zone B is ', mean_sales_B)
print('Mean sales generated by Zone C is ', mean_sales_C)
print('Mean sales generated by Zone D is ', mean_sales_D)

Mean sales generated by Zone A is  1540493.14
Mean sales generated by Zone B is  1755559.59
Mean sales generated by Zone C is  1772871.03
Mean sales generated by Zone D is  1842926.76

# 2. Total sales generated by all the zones for each month

In [70]:
data['Total Sales']=data.sum(axis=1)

In [71]:
data1=data[['Month','Total Sales']]
data1

         Month  Total Sales
0    Month - 1      7022544
1    Month - 2      7152303
2    Month - 3      6475939
3    Month - 4      8174449
4    Month - 5      5995328
5    Month - 6      7151387
6    Month - 7      7287108
7    Month - 8      7816299
8    Month - 9      6703395
9   Month - 10      7128210
10  Month - 11      7032783
11  Month - 12      6111084
12  Month - 13      5925424
13  Month - 14      7155515
14  Month - 15      5934156
15  Month - 16      6506659
16  Month - 17      7149383
17  Month - 18      7083490
18  Month - 19      6971953
19  Month - 20      7124599
20  Month - 21      7389597
21  Month - 22      7560001
22  Month - 23      6687919
23  Month - 24      7784747
24  Month - 25      6095918
25  Month - 26      6512360
26  Month - 27      6267918
27  Month - 28      7470920
28  Month - 29      6772277

# 3. Check whether all the zones generate the same amount of sales

Here we are using the one-way ANOVA

Hypothesis

 H0: All the zones generate same amount of sales

H1: All the zones not generate same amount of sales

set significance level, alpha as 0.05

In [72]:
statistic, p_value=stat.f_oneway(Zone_A, Zone_B, Zone_C, Zone_D)
print('Statistic is ', statistic)
print('p-value is ', p_value)

Statistic is  5.672056106843581
p-value is  0.0011827601694503335

In [73]:
if p_value < 0.05:
    print('We reject null hypothesis')
else:
    print('We fail to reject null hypothesis')

We reject null hypothesis

Here we reject null hypothesis. So we can conclude that there is a change in the sales generated by each zone.